OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf448.h
#define _RXB0DLC_DLC0           0x01
#define _RXB0DLC_DLC1           0x02
#define _RXB0DLC_DLC2           0x04
#define _RXB0DLC_DLC3           0x08
#define _RXB0DLC_RB0            0x10
#define _RXB0DLC_RESB0          0x10
#define _RXB0DLC_RB1            0x20
#define _RXB0DLC_RESB1          0x20
#define _RXB0DLC_RXRTR          0x40

//==============================================================================


//==============================================================================
//        RXB0D0 Bits

extern __at(0x0F66) __sfr RXB0D0;

typedef union
  {
  struct
    {
    unsigned RXB0D00            : 1;
    unsigned RXB0D01            : 1;
    unsigned RXB0D02            : 1;
    unsigned RXB0D03            : 1;
    unsigned RXB0D04            : 1;
    unsigned RXB0D05            : 1;
    unsigned RXB0D06            : 1;
    unsigned RXB0D07            : 1;
    };

  struct
    {
    unsigned RB0D00             : 1;
    unsigned RB0D01             : 1;
    unsigned RB0D02             : 1;
    unsigned RB0D03             : 1;
    unsigned RB0D04             : 1;
    unsigned RB0D05             : 1;
    unsigned RB0D06             : 1;
    unsigned RB0D07             : 1;
    };
  } __RXB0D0bits_t;

extern __at(0x0F66) volatile __RXB0D0bits_t RXB0D0bits;

#define _RXB0D00                0x01
#define _RB0D00                 0x01
#define _RXB0D01                0x02
#define _RB0D01                 0x02
#define _RXB0D02                0x04
#define _RB0D02                 0x04
#define _RXB0D03                0x08
#define _RB0D03                 0x08
#define _RXB0D04                0x10
#define _RB0D04                 0x10
#define _RXB0D05                0x20
#define _RB0D05                 0x20
#define _RXB0D06                0x40
#define _RB0D06                 0x40
#define _RXB0D07                0x80
#define _RB0D07                 0x80

//==============================================================================


//==============================================================================
//        RXB0D1 Bits

extern __at(0x0F67) __sfr RXB0D1;

typedef union
  {
  struct
    {
    unsigned RXB0D10            : 1;
    unsigned RXB0D11            : 1;
    unsigned RXB0D12            : 1;
    unsigned RXB0D13            : 1;
    unsigned RXB0D14            : 1;
    unsigned RXB0D15            : 1;
    unsigned RXB0D16            : 1;
    unsigned RXB0D17            : 1;
    };

  struct
    {
    unsigned RB0D10             : 1;
    unsigned RB0D11             : 1;
    unsigned RB0D12             : 1;
    unsigned RB0D13             : 1;
    unsigned RB0D14             : 1;
    unsigned RB0D15             : 1;
    unsigned RB0D16             : 1;
    unsigned RB0D17             : 1;
    };
  } __RXB0D1bits_t;

extern __at(0x0F67) volatile __RXB0D1bits_t RXB0D1bits;

#define _RXB0D10                0x01
#define _RB0D10                 0x01
#define _RXB0D11                0x02
#define _RB0D11                 0x02
#define _RXB0D12                0x04
#define _RB0D12                 0x04
#define _RXB0D13                0x08
#define _RB0D13                 0x08
#define _RXB0D14                0x10
#define _RB0D14                 0x10
#define _RXB0D15                0x20
#define _RB0D15                 0x20
#define _RXB0D16                0x40
#define _RB0D16                 0x40
#define _RXB0D17                0x80
#define _RB0D17                 0x80

//==============================================================================


//==============================================================================
//        RXB0D2 Bits

extern __at(0x0F68) __sfr RXB0D2;

typedef union
  {
  struct
    {
    unsigned RXB0D20            : 1;
    unsigned RXB0D21            : 1;
    unsigned RXB0D22            : 1;
    unsigned RXB0D23            : 1;
    unsigned RXB0D24            : 1;
    unsigned RXB0D25            : 1;
    unsigned RXB0D26            : 1;
    unsigned RXB0D27            : 1;
    };

  struct
    {
    unsigned RB0D20             : 1;
    unsigned RB0D21             : 1;
    unsigned RB0D22             : 1;
    unsigned RB0D23             : 1;
    unsigned RB0D24             : 1;
    unsigned RB0D25             : 1;
    unsigned RB0D26             : 1;
    unsigned RB0D27             : 1;
    };
  } __RXB0D2bits_t;

extern __at(0x0F68) volatile __RXB0D2bits_t RXB0D2bits;

#define _RXB0D20                0x01
#define _RB0D20                 0x01
#define _RXB0D21                0x02
#define _RB0D21                 0x02
#define _RXB0D22                0x04
#define _RB0D22                 0x04
#define _RXB0D23                0x08
#define _RB0D23                 0x08
#define _RXB0D24                0x10
#define _RB0D24                 0x10
#define _RXB0D25                0x20
#define _RB0D25                 0x20
#define _RXB0D26                0x40
#define _RB0D26                 0x40
#define _RXB0D27                0x80
#define _RB0D27                 0x80

//==============================================================================


//==============================================================================
//        RXB0D3 Bits

extern __at(0x0F69) __sfr RXB0D3;

typedef union
  {
  struct
    {
    unsigned RXB0D30            : 1;
    unsigned RXB0D31            : 1;
    unsigned RXB0D32            : 1;
    unsigned RXB0D33            : 1;
    unsigned RXB0D34            : 1;
    unsigned RXB0D35            : 1;
    unsigned RXB0D36            : 1;
    unsigned RXB0D37            : 1;
    };

  struct
    {
    unsigned RB0D30             : 1;
    unsigned RB0D31             : 1;
    unsigned RB0D32             : 1;
    unsigned RB0D33             : 1;
    unsigned RB0D34             : 1;
    unsigned RB0D35             : 1;
    unsigned RB0D36             : 1;
    unsigned RB0D37             : 1;
    };
  } __RXB0D3bits_t;

extern __at(0x0F69) volatile __RXB0D3bits_t RXB0D3bits;

#define _RXB0D30                0x01
#define _RB0D30                 0x01
#define _RXB0D31                0x02
#define _RB0D31                 0x02
#define _RXB0D32                0x04
#define _RB0D32                 0x04
#define _RXB0D33                0x08
#define _RB0D33                 0x08
#define _RXB0D34                0x10
#define _RB0D34                 0x10
#define _RXB0D35                0x20
#define _RB0D35                 0x20
#define _RXB0D36                0x40
#define _RB0D36                 0x40
#define _RXB0D37                0x80
#define _RB0D37                 0x80

//==============================================================================


//==============================================================================
//        RXB0D4 Bits

extern __at(0x0F6A) __sfr RXB0D4;

typedef union
  {
  struct
    {
    unsigned RXB0D40            : 1;
    unsigned RXB0D41            : 1;
    unsigned RXB0D42            : 1;
    unsigned RXB0D43            : 1;
    unsigned RXB0D44            : 1;
    unsigned RXB0D45            : 1;
    unsigned RXB0D46            : 1;
    unsigned RXB0D47            : 1;
    };

  struct
    {
    unsigned RB0D40             : 1;
    unsigned RB0D41             : 1;
    unsigned RB0D42             : 1;
    unsigned RB0D43             : 1;
    unsigned RB0D44             : 1;
    unsigned RB0D45             : 1;
    unsigned RB0D46             : 1;
    unsigned RB0D47             : 1;
    };
  } __RXB0D4bits_t;

extern __at(0x0F6A) volatile __RXB0D4bits_t RXB0D4bits;

#define _RXB0D40                0x01
#define _RB0D40                 0x01
#define _RXB0D41                0x02
#define _RB0D41                 0x02
#define _RXB0D42                0x04
#define _RB0D42                 0x04
#define _RXB0D43                0x08
#define _RB0D43                 0x08
#define _RXB0D44                0x10
#define _RB0D44                 0x10
#define _RXB0D45                0x20
#define _RB0D45                 0x20
#define _RXB0D46                0x40
#define _RB0D46                 0x40
#define _RXB0D47                0x80
#define _RB0D47                 0x80

//==============================================================================


//==============================================================================
//        RXB0D5 Bits

extern __at(0x0F6B) __sfr RXB0D5;

typedef union
  {
  struct
    {
    unsigned RXB0D50            : 1;
    unsigned RXB0D51            : 1;
    unsigned RXB0D52            : 1;
    unsigned RXB0D53            : 1;
    unsigned RXB0D54            : 1;
    unsigned RXB0D55            : 1;
    unsigned RXB0D56            : 1;
    unsigned RXB0D57            : 1;
    };

  struct
    {
    unsigned RB0D50             : 1;
    unsigned RB0D51             : 1;
    unsigned RB0D52             : 1;
    unsigned RB0D53             : 1;
    unsigned RB0D54             : 1;
    unsigned RB0D55             : 1;
    unsigned RB0D56             : 1;
    unsigned RB0D57             : 1;
    };
  } __RXB0D5bits_t;

extern __at(0x0F6B) volatile __RXB0D5bits_t RXB0D5bits;

#define _RXB0D50                0x01
#define _RB0D50                 0x01
#define _RXB0D51                0x02
#define _RB0D51                 0x02
#define _RXB0D52                0x04
#define _RB0D52                 0x04
#define _RXB0D53                0x08
#define _RB0D53                 0x08
#define _RXB0D54                0x10
#define _RB0D54                 0x10
#define _RXB0D55                0x20
#define _RB0D55                 0x20
#define _RXB0D56                0x40
#define _RB0D56                 0x40
#define _RXB0D57                0x80
#define _RB0D57                 0x80

//==============================================================================


//==============================================================================
//        RXB0D6 Bits

extern __at(0x0F6C) __sfr RXB0D6;

typedef union
  {
  struct
    {
    unsigned RXB0D60            : 1;
    unsigned RXB0D61            : 1;
    unsigned RXB0D62            : 1;
    unsigned RXB0D63            : 1;
    unsigned RXB0D64            : 1;
    unsigned RXB0D65            : 1;
    unsigned RXB0D66            : 1;
    unsigned RXB0D67            : 1;
    };

  struct
    {
    unsigned RB0D60             : 1;
    unsigned RB0D61             : 1;
    unsigned RB0D62             : 1;
    unsigned RB0D63             : 1;
    unsigned RB0D64             : 1;
    unsigned RB0D65             : 1;
    unsigned RB0D66             : 1;
    unsigned RB0D67             : 1;
    };
  } __RXB0D6bits_t;

extern __at(0x0F6C) volatile __RXB0D6bits_t RXB0D6bits;

#define _RXB0D60                0x01
#define _RB0D60                 0x01
#define _RXB0D61                0x02
#define _RB0D61                 0x02
#define _RXB0D62                0x04
#define _RB0D62                 0x04
#define _RXB0D63                0x08
#define _RB0D63                 0x08
#define _RXB0D64                0x10
#define _RB0D64                 0x10
#define _RXB0D65                0x20
#define _RB0D65                 0x20
#define _RXB0D66                0x40
#define _RB0D66                 0x40
#define _RXB0D67                0x80
#define _RB0D67                 0x80

//==============================================================================


//==============================================================================
//        RXB0D7 Bits

extern __at(0x0F6D) __sfr RXB0D7;

typedef union
  {
  struct
    {
    unsigned RXB0D70            : 1;
    unsigned RXB0D71            : 1;
    unsigned RXB0D72            : 1;
    unsigned RXB0D73            : 1;
    unsigned RXB0D74            : 1;
    unsigned RXB0D75            : 1;
    unsigned RXB0D76            : 1;
    unsigned RXB0D77            : 1;
    };

  struct
    {
    unsigned RB0D70             : 1;
    unsigned RB0D71             : 1;
    unsigned RB0D72             : 1;
    unsigned RB0D73             : 1;
    unsigned RB0D74             : 1;
    unsigned RB0D75             : 1;
    unsigned RB0D76             : 1;
    unsigned RB0D77             : 1;
    };
  } __RXB0D7bits_t;

extern __at(0x0F6D) volatile __RXB0D7bits_t RXB0D7bits;

#define _RXB0D70                0x01
#define _RB0D70                 0x01
#define _RXB0D71                0x02
#define _RB0D71                 0x02
#define _RXB0D72                0x04
#define _RB0D72                 0x04
#define _RXB0D73                0x08
#define _RB0D73                 0x08
#define _RXB0D74                0x10
#define _RB0D74                 0x10
#define _RXB0D75                0x20
#define _RB0D75                 0x20
#define _RXB0D76                0x40
#define _RB0D76                 0x40
#define _RXB0D77                0x80
#define _RB0D77                 0x80

//==============================================================================


//==============================================================================
//        CANSTAT Bits

